mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2dhxg/s6e2dhxg.svd
        <!-- REGISTER "BREG5E" -->
        <register>
          <name>BREG5E</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x15E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG5F" -->
        <register>
          <name>BREG5F</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x15F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG60" -->
        <register>
          <name>BREG60</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x160</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG61" -->
        <register>
          <name>BREG61</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x161</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG62" -->
        <register>
          <name>BREG62</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x162</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG63" -->
        <register>
          <name>BREG63</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x163</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG64" -->
        <register>
          <name>BREG64</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x164</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG65" -->
        <register>
          <name>BREG65</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x165</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG66" -->
        <register>
          <name>BREG66</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x166</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG67" -->
        <register>
          <name>BREG67</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x167</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG68" -->
        <register>
          <name>BREG68</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x168</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG69" -->
        <register>
          <name>BREG69</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x169</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG6A" -->
        <register>
          <name>BREG6A</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x16A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG6B" -->
        <register>
          <name>BREG6B</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x16B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG6C" -->
        <register>
          <name>BREG6C</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x16C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG6D" -->
        <register>
          <name>BREG6D</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x16D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG6E" -->
        <register>
          <name>BREG6E</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x16E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG6F" -->
        <register>
          <name>BREG6F</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x16F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG70" -->
        <register>
          <name>BREG70</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x170</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG71" -->
        <register>
          <name>BREG71</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x171</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
