mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2dhxg/s6e2dhxg.svd
      </registers>
    </peripheral>
    <!-- PERIPHERAL "PCRC" -->
    <peripheral>
      <name>PCRC</name>
      <description>0</description>
      <version>A</version>
      <groupName>PCRC</groupName>
      <baseAddress>0x40080000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x14</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "PCRC_I2S0_1" -->
      <interrupt>
        <name>PCRC_I2S0_1</name>
        <value>117</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "PCRC_POLY" -->
        <register>
          <name>PCRC_POLY</name>
          <description>CRC Computing Generator Polynomial Register [BHW]</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x04C11DB7</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "PCRC_SEED" -->
        <register>
          <name>PCRC_SEED</name>
          <description>CRC Computing Initial Value Register [BHW]</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "PCRC_FXOR" -->
        <register>
          <name>PCRC_FXOR</name>
          <description>CRC Computing Resault XOR Value Register [BHW]</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "PCRC_CFG" -->
        <register>
          <name>PCRC_CFG</name>
          <description>CRC Computing Configuration Register [BHW]</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00E00000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LOCK" -->
            <field>
              <name>LOCK</name>
              <description>Lock</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CDEN" -->
            <field>
              <name>CDEN</name>
              <description>DMA request enable</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CIEN" -->
            <field>
              <name>CIEN</name>
              <description>Interrupt request enable</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CIRQ" -->
            <field>
              <name>CIRQ</name>
              <description>Interrupt request</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SZ" -->
            <field>
              <name>SZ</name>
              <description>Input data size</description>
              <msb>23</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TEST" -->
            <field>
              <name>TEST</name>
              <description>Test</description>
              <msb>21</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FI" -->
            <field>
              <name>FI</name>
              <description>Input data format</description>
              <msb>11</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FO" -->
            <field>
              <name>FO</name>
              <description>output data format</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CIRQCLR" -->
            <field>
              <name>CIRQCLR</name>
              <description>Interrupt request clear</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PCRC_WR" -->
        <register>
          <name>PCRC_WR</name>
          <description>CRC Computing Input Data Register [BHW]</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "PCRC_RD" -->
        <register>
          <name>PCRC_RD</name>
          <description>CRC Computing Output Data Register [BHW]</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
