mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2dhxg/s6e2dhxg.svd
        <!-- REGISTER "PCC3" -->
        <register derivedFrom="PCC0">
          <name>PCC3</name>
          <description>Peripheral Communication Setting Registers 3 [BHW]</description>
          <addressOffset>0x10</addressOffset>
        </register>
        <!-- REGISTER "TXF" -->
        <register>
          <name>TXF</name>
          <description>Transmission Interrupt Factor Register [BHW]</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000007F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TSSRS" -->
            <field>
              <name>TSSRS</name>
              <description>Slave select released detection bit</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TFMTS" -->
            <field>
              <name>TFMTS</name>
              <description>TX-FIFO-exceeded-threshold detection bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TFLETS" -->
            <field>
              <name>TFLETS</name>
              <description>TX-FIFO-less-than-or-equal-to-threshold detection bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TFUS" -->
            <field>
              <name>TFUS</name>
              <description>TX-FIFO underrun detection bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TFOS" -->
            <field>
              <name>TFOS</name>
              <description>TX-FIFO overrun detection bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TFES" -->
            <field>
              <name>TFES</name>
              <description>TX-FIFO and shift register empty detection bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TFFS" -->
            <field>
              <name>TFFS</name>
              <description>TX-FIFO full detection bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TXE" -->
        <register>
          <name>TXE</name>
          <description>Transmission Interrupt Enable Register [BHW]</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000007F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TSSRE" -->
            <field>
              <name>TSSRE</name>
              <description>Slave select released detection interrupt enable bit</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TFMTE" -->
            <field>
              <name>TFMTE</name>
              <description>TX-FIFO-exceeded-threshold detection interrupt enable bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TFLETE" -->
            <field>
              <name>TFLETE</name>
              <description>TX-FIFO-less-than-or-equal-to-threshold detection interrupt enable bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TFUE" -->
            <field>
              <name>TFUE</name>
              <description>TX-FIFO underrun detection interrupt enable bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TFOE" -->
            <field>
              <name>TFOE</name>
              <description>TX-FIFO overrun detection interrupt enable bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TFEE" -->
            <field>
              <name>TFEE</name>
              <description>TX-FIFO and shift register empty detection interrupt enable bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TFFE" -->
            <field>
              <name>TFFE</name>
              <description>TX-FIFO full detection interrupt enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TXC" -->
        <register>
          <name>TXC</name>
          <description>Transmission Interrupt Clear Register [BHW]</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000007F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TSSRC" -->
            <field>
              <name>TSSRC</name>
              <description>Slave select released detection clear bit</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "TFMTC" -->
            <field>
              <name>TFMTC</name>
              <description>TX-FIFO-exceeded-threshold detection clear bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "TFLETC" -->
            <field>
              <name>TFLETC</name>
              <description>TX-FIFO-less-than-or-equal-to-threshold detection clear bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "TFUC" -->
            <field>
              <name>TFUC</name>
              <description>TX-FIFO underrun detection clear bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "TFOC" -->
            <field>
              <name>TFOC</name>
              <description>TX-FIFO overrun detection clear bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "TFEC" -->
            <field>
              <name>TFEC</name>
              <description>TX-FIFO and shift register empty detection clear bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "TFFC" -->
            <field>
              <name>TFFC</name>
              <description>TX-FIFO full detection clear bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RXF" -->
        <register>
          <name>RXF</name>
          <description>Reception Interrupt Factor Register [BHW]</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000007F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RSSRS" -->
            <field>
              <name>RSSRS</name>
              <description>Slave select released detection bit</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RFMTS" -->
            <field>
              <name>RFMTS</name>
              <description>RX-FIFO-exceeded-threshold detection bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RFLETS" -->
            <field>
              <name>RFLETS</name>
              <description>RX-FIFO-less-than-or-equal-to-threshold detection bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RFUS" -->
            <field>
              <name>RFUS</name>
              <description>RX-FIFO underrun detection bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RFOS" -->
            <field>
              <name>RFOS</name>
              <description>RX-FIFO overrun detection bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RFES" -->
            <field>
              <name>RFES</name>
              <description>RX-FIFO empty detection bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RFFS" -->
            <field>
              <name>RFFS</name>
              <description>RX-FIFO full detection bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RXE" -->
        <register>
          <name>RXE</name>
          <description>Reception Interrupt Enable Register [BHW]</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000007F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RSSRE" -->
            <field>
              <name>RSSRE</name>
              <description>Slave select released detection interrupt enable bit</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RFMTE" -->
            <field>
              <name>RFMTE</name>
              <description>RX-FIFO-exceeded-threshold detection interrupt enable bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RFLETE" -->
            <field>
              <name>RFLETE</name>
              <description>RX-FIFO-less-than-or-equal-to-threshold detection interrupt enable bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RFUE" -->
            <field>
              <name>RFUE</name>
              <description>RX-FIFO underrun detection interrupt enable bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RFOE" -->
            <field>
              <name>RFOE</name>
              <description>RX-FIFO overrun detection interrupt enable bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RFEE" -->
            <field>
              <name>RFEE</name>
              <description>RX-FIFO and shift register empty-state detection interrupt enable bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RFFE" -->
            <field>
              <name>RFFE</name>
              <description>RX-FIFO full detection interrupt enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
